IDEA StatiCa Open Model
WeldData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the single weld
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.WeldData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class WeldData
Public Class WeldData
public ref class WeldData
The WeldData type exposes the following members.
Constructors
Name | Description
WeldData
Initializes a new instance of the WeldData class
Top
Properties
Name | Description
ConnectedPartIds
 Id of the weld
End
 End of the weld
Id
 Id of the weld
Material
 Name of the material
Name
 Name of the weld
Start
 Start of the weld
Thickness
 Thickness of the weld
WeldType
 Type of the weld
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace